САБ/AccumulationRegisters/CW_ОперативнаяДебиторскаяЗадолженность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>CW_ОперативнаяДебиторскаяЗадолженность</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Всего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Счет</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

САБ/Documents/CW_ДоходыПоГрузоперевозке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>CW_ДоходыПоГрузоперевозке</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаСчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВедомыйСчетФактура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВедомыйСчет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Корректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаАкта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыОперацийДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СписокКонтейнеров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВедомыйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерИсправления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СпособЗачетаАвансовОЗ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыЗачетаАвансов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерАкта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПредставлениеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВводОстатковБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВводОстатковОЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СпособЗачетаАвансов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыЗачетаАвансов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормируетсяСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормируетсяАкт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормируетсяСчетФактура</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КорректируемыйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Грузоперевозка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПорядокОтражения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

САБ/CommonModules/CW_Финансы/Ext/Module.bsl
&ИзменениеИКонтроль("ТаблицаАвансовДляОЗ")
Функция саб_ТаблицаАвансовДляОЗ(Параметры, ТаблицаДокумента, ТаблицаЗачета)

	ВалютаРегламентированногоУчетаРубль = ПолучитьФункциональнуюОпцию("CW_ВалютаРегламентированногоУчетаРубль");

	Дата			= Параметры.Дата;
	Договор			= Параметры.Договор;

	//Подсистема.УчетПриложенийДоговоров
	ПриложениеКДоговору = Параметры.ПриложениеКДоговору;
	//Подсистема.УчетПриложенийДоговоров

	ПереплатаКакАванс   = Параметры.ПереплатаКакАванс;

	Организация		= Договор.Организация;
	Контрагент		= Договор.Владелец; 

	Если ЗначениеЗаполнено(ПриложениеКДоговору) Тогда
		Валюта = ПриложениеКДоговору.ВалютаДоговора;
	Иначе
		Валюта = Договор.ВалютаДоговора;
	КонецЕсли;	

	ВестиУчетПоПодразделениям 	= ложь;
	ПодразделениеОрганизации 	= Неопределено;

	//Для версии КОРП
	Если Параметры.Свойство("ВестиУчетПоПодразделениям") Тогда
		ВестиУчетПоПодразделениям 	= Параметры.ВестиУчетПоПодразделениям;
		ПодразделениеОрганизации 	= Параметры.ПодразделениеОрганизации;
	КонецЕсли;
	//Для версии КОРП

	// --- 
	ЭтоПокупатель = ДоговорПокупателя(Договор); 
	ЭтоПоставщик = (НЕ ЭтоПокупатель);
	// --- 
	ОЗ = Параметры.ОЗ;

	Если (НЕ ОЗ) Тогда

		Возврат(Неопределено);

	КонецЕсли; 

	// --- 

	СчетаУчета = ТаблицаДокумента.Скопировать(,"СчетЗадолженности");
	СчетаУчета.Свернуть("СчетЗадолженности");

	Если (ЭтоПоставщик) Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	-CW_ОперативнаяКредиторскаяЗадолженностьОстатки.Всего_ВалютаОстаток КАК Аванс,
		|	CW_ОперативнаяКредиторскаяЗадолженностьОстатки.СчетУчета КАК СчетЗадолженности,
		|	CW_ОперативнаяКредиторскаяЗадолженностьОстатки.Валюта КАК Валюта,
		|	CW_ОперативнаяКредиторскаяЗадолженностьОстатки.Счет КАК ДокументОплаты,
		|	CW_ОперативнаяКредиторскаяЗадолженностьОстатки.Счет.Основание КАК ДокументАванса
		|ПОМЕСТИТЬ тмп
		|ИЗ
		|	РегистрНакопления.CW_ОперативнаяКредиторскаяЗадолженность.Остатки(
		|			&Период,
		|			СчетУчета В (&Счета)
		|				И Контрагент = &Контрагент
		|				И Договор = &Договор
		//Подсистема.УчетПриложенийДоговоров
		|				И ПриложениеКДоговору = &ПриложениеКДоговору
		//Подсистема.УчетПриложенийДоговоров
		|				И Валюта = &Валюта
		|				И Организация = &Организация
		|				И ВЫБОР
		|					КОГДА &ВестиУчетПоПодразделениям
		|						ТОГДА ВЫБОР
		|								КОГДА Счет ССЫЛКА Документ.CW_РасходыПоГрузоперевозке
		|										ИЛИ Счет ССЫЛКА Документ.CW_Оплата
		|										ИЛИ Счет ССЫЛКА Документ.CW_РасходыПоПриобретениям
		|									ТОГДА Счет.ПодразделениеОрганизации = &ПодразделениеОрганизации
		|								ИНАЧЕ ИСТИНА
		|							КОНЕЦ
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ
		|				И ВЫБОР
		|					КОГДА &ПереплатаКакАванс = ЛОЖЬ
		|						ТОГДА Счет ССЫЛКА Документ.CW_Оплата
		|								ИЛИ Счет ССЫЛКА Документ.CW_ДвижениеДенежныхСредств
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК CW_ОперативнаяКредиторскаяЗадолженностьОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тмп.Аванс КАК Аванс,
		|	тмп.СчетЗадолженности КАК СчетЗадолженности,
		|	тмп.Валюта КАК Валюта,
		|	тмп.ДокументОплаты КАК ДокументОплаты,
		|	тмп.ДокументАванса КАК ДокументАванса,
		|	тмп.ДокументОплаты.Дата КАК Дата
		|ИЗ
		|	тмп КАК тмп
		|ГДЕ
		|	тмп.Аванс > 0";

		Запрос.УстановитьПараметр("Счета", 			СчетаУчета.ВыгрузитьКолонку("СчетЗадолженности"));
		Запрос.УстановитьПараметр("Период", 		Дата); 
		Запрос.УстановитьПараметр("Организация", 	Организация); 
		Запрос.УстановитьПараметр("Контрагент", 	Контрагент);
		Запрос.УстановитьПараметр("Договор", 		Договор);

		//Подсистема.УчетПриложенийДоговоров
		Запрос.УстановитьПараметр("ПриложениеКДоговору", ПриложениеКДоговору);
		//Подсистема.УчетПриложенийДоговоров

		Запрос.УстановитьПараметр("ПереплатаКакАванс", 	 ПереплатаКакАванс);

		Запрос.УстановитьПараметр("Валюта", Валюта); 
        #Вставка
		//+++САБ 4952
		ВестиУчетПоПодразделениям = Ложь;
		#КонецВставки		
		Запрос.УстановитьПараметр("ВестиУчетПоПодразделениям"		, ВестиУчетПоПодразделениям);
		Запрос.УстановитьПараметр("ПодразделениеОрганизации"		, ПодразделениеОрганизации); 
		// --- 
		ТЗ=Запрос.Выполнить().Выгрузить();
		_сф.т_ДобавитьКолонку(ТЗ,"СчетАванса");
		_сф.т_ДобавитьКолонку(ТЗ,"Зачтено");
		_сф.т_ДобавитьКолонку(ТЗ,"ПризнакОплатыСчетовДокумента");
		_сф.т_ДобавитьКолонку(ТЗ,"ПредставлениеДокументаАванса");
		МассивУдаления = Новый Массив;
		Для каждого Стр Из ТЗ Цикл

			Стр.ПризнакОплатыСчетовДокумента = Ложь;
			Стр.ПредставлениеДокументаАванса = "";
			Стр.СчетАванса = СчетАванса(Стр.СчетЗадолженности);
			Стр.Зачтено = 0;

		КонецЦикла; 
		_сф.к_УдалитьЭлементыПоМассиву(ТЗ, МассивУдаления);
		ТЗ.Сортировать("Дата Возр");

	ИначеЕсли (ЭтоПокупатель) Тогда 

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	-CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Всего_ВалютаОстаток КАК Аванс,
		|	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.СчетУчета КАК СчетЗадолженности,
		|	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Валюта КАК Валюта,
		|	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Счет КАК ДокументОплаты,
		|	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Счет.Основание КАК ДокументАванса
		|ПОМЕСТИТЬ тмп
		|ИЗ
		|	РегистрНакопления.CW_ОперативнаяДебиторскаяЗадолженность.Остатки(
		|			&Период,
		|			СчетУчета В (&Счета)
		|				И Контрагент = &Контрагент
		|				И Договор = &Договор
		//Подсистема.УчетПриложенийДоговоров
		|				И ПриложениеКДоговору = &ПриложениеКДоговору
		//Подсистема.УчетПриложенийДоговоров
		|				И Валюта = &Валюта
		|				И Организация = &Организация
		|				И ВЫБОР
		|					КОГДА &ВестиУчетПоПодразделениям
		|						ТОГДА ВЫБОР
		|								КОГДА Счет ССЫЛКА Документ.CW_ДоходыПоГрузоперевозке
		|										ИЛИ Счет ССЫЛКА Документ.CW_Оплата
		|									ТОГДА Счет.ПодразделениеОрганизации = &ПодразделениеОрганизации
		|								ИНАЧЕ ИСТИНА
		|							КОНЕЦ
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ
		|				И ВЫБОР
		|					КОГДА &ПереплатаКакАванс = ЛОЖЬ
		|						ТОГДА Счет ССЫЛКА Документ.CW_Оплата 
		|								ИЛИ Счет ССЫЛКА Документ.CW_ДвижениеДенежныхСредств
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК CW_ОперативнаяДебиторскаяЗадолженностьОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тмп.Аванс КАК Аванс,
		|	тмп.СчетЗадолженности КАК СчетЗадолженности,
		|	тмп.Валюта КАК Валюта,
		|	тмп.ДокументОплаты КАК ДокументОплаты,
		|	тмп.ДокументАванса КАК ДокументАванса,
		|	тмп.ДокументОплаты.Дата КАК Дата
		|ИЗ
		|	тмп КАК тмп
		|ГДЕ
		|	тмп.Аванс > 0";

		Запрос.УстановитьПараметр("Счета", СчетаУчета.ВыгрузитьКолонку("СчетЗадолженности"));
		Запрос.УстановитьПараметр("Период", Дата); 
		Запрос.УстановитьПараметр("Организация", Организация); 
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		Запрос.УстановитьПараметр("Договор", Договор);

		//Подсистема.УчетПриложенийДоговоров
		Запрос.УстановитьПараметр("ПриложениеКДоговору", ПриложениеКДоговору);
		//Подсистема.УчетПриложенийДоговоров

		Запрос.УстановитьПараметр("ПереплатаКакАванс", 	ПереплатаКакАванс);

		Запрос.УстановитьПараметр("Валюта", Валюта); 

		Запрос.УстановитьПараметр("ВестиУчетПоПодразделениям"	, ВестиУчетПоПодразделениям);
		Запрос.УстановитьПараметр("ПодразделениеОрганизации"	, ПодразделениеОрганизации); 

		ТЗ=Запрос.Выполнить().Выгрузить();
		_сф.т_ДобавитьКолонку(ТЗ,"СчетАванса");
		_сф.т_ДобавитьКолонку(ТЗ,"Зачтено");
		_сф.т_ДобавитьКолонку(ТЗ,"ПризнакОплатыСчетовДокумента");
		_сф.т_ДобавитьКолонку(ТЗ,"ПредставлениеДокументаАванса");
		МассивУдаления = Новый Массив;
		Для каждого Стр Из ТЗ Цикл

			Стр.ПризнакОплатыСчетовДокумента = Ложь;
			Стр.ПредставлениеДокументаАванса = "";
			Стр.СчетАванса = СчетАванса(Стр.СчетЗадолженности);
			Стр.Зачтено = 0;

		КонецЦикла; 
		_сф.к_УдалитьЭлементыПоМассиву(ТЗ, МассивУдаления); 
		ТЗ.Сортировать("Дата Возр");

	КонецЕсли; 

	// --- 
	Для каждого Стр Из ТЗ Цикл

		Отбор = _сф.ст_Создать("ДокументОплаты,СчетЗадолженности",Стр);
		СтрокиСтарогоЗачета = ТаблицаЗачета.Скопировать(Отбор);
		Если (_сф.Количество(СтрокиСтарогоЗачета)<>0) Тогда
			Стр.Зачтено = _сф.Итог(СтрокиСтарогоЗачета,"СуммаЗачета");
		КонецЕсли; 

	КонецЦикла; 
	// --- 
	Возврат(ТЗ);

КонецФункции
